Catalogs/ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ИнформационныеБазы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Кластеры1С</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерверБД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерверыБД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НазначенияИБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиИБ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторБазы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователяИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователяИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеВКластере</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеКонфигурации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищаКонфигураций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВебСервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВебСерверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыИнформационнойБазы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользуетсяПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доступ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПользовательГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПользователиИБ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/АдминистрированиеИнформационныхБаз/Ext/Module.bsl
//// Возвращает путь к консольному клиенту сервера администрирования.
////
//// Возвращаемое значение:
////   Строка
////
//Функция ПутьККлиентуСервераАдминистрирования() Экспорт
//	
//	КаталогЗапуска = КаталогИсполняемыхФайловПлатформы();
//	Клиент = КаталогЗапуска + "ibcmd";
//	
//	Возврат Клиент;
//	
//КонецФункции

//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции

//Функция КаталогИсполняемыхФайловПлатформы()
//	
//	Результат = КаталогПрограммы();
//	СимволРазделителя = ПолучитьРазделительПути();
//	
//	Если Прав(Результат, 1) <> СимволРазделителя Тогда
//		Результат = Результат + СимволРазделителя;
//	КонецЕсли;
//	
//	Возврат Результат;
//	
//КонецФункции


//Функция СоздатьИнформационнуюБазу(Знач ПараметрыАдминистрированияКластера, Знач ПараметрыАдминистрированияИБ, Знач Словарь) Экспорт //Nexus +Экспорт
//	
//	//ibcmd infobase create --dbms=mssqlserver --db-server=dbServerName --db-user=dbUser --db-pwd=dbUserPassword --db-name=my-db --name=docsIB --create-database --load="D:\Cfgs\MyApp\1Cv8.cf" --apply
//	Команда = "infobase info --infobase=%1 --infobase-user=%2 --infobase-pwd=%3";
//	ПодставитьПараметрыВКоманду(Команда, 
//		ИдентификаторИнформационнойБазы, 
//		ПараметрыАдминистрированияИБ.ИмяАдминистратораИнформационнойБазы, 
//		ПараметрыАдминистрированияИБ.ПарольАдминистратораИнформационнойБазы);
//		
//	Результат = ЗапуститьКоманду(Команда + " " + ПараметрыКластера, ПараметрыАдминистрированияКластера, Словарь, , ТипыСвойствИнформационнойБазы());
//	
//	Возврат Результат[0];
//	
//КонецФункции  

//#КонецОбласти   

Функция ПолучитьСтруктуруПараметровИнформационнойБазы()
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("АдресСервераАдминистрирования"); 	СтруктураПараметров.Вставить("ПортСервераАдминистрирования"); 	СтруктураПараметров.Вставить("ПользовательЦентральногоСервер"); 	СтруктураПараметров.Вставить("ПарольЦентральногоСервера"); 	СтруктураПараметров.Вставить("СерверБД"); 	СтруктураПараметров.Вставить("БазаДанных"); 	СтруктураПараметров.Вставить("ИмяАдминистратораСУБД"); 	СтруктураПараметров.Вставить("ПарольАдминистратораСУБД"); 	СтруктураПараметров.Вставить("АдресКластера"); 	СтруктураПараметров.Вставить("ПортКластера"); 	СтруктураПараметров.Вставить("ИмяИБ"); 	СтруктураПараметров.Вставить("ИмяПользователяИБ"); 	СтруктураПараметров.Вставить("ПарольПользователяИБ"); 
	
	Возврат СтруктураПараметров;

КонецФункции // ПолучитьСтруктуруПараметровИнформационнойБазы()

Функция ПолучитьПараметрыИнформационнойБазы(ИнформационнаяБаза) Экспорт
	
	//#TODO
	СтруктураПараметров = ПолучитьСтруктуруПараметровИнформационнойБазы();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИнформационныеБазы.Владелец.АдресСервераАдминистрирования КАК АдресСервераАдминистрирования,
	               |	ИнформационныеБазы.Владелец.ПортСервераАдминистрирования КАК ПортСервераАдминистрирования,
	               |	ИнформационныеБазы.Владелец.ПользовательЦентральногоСервер КАК ПользовательЦентральногоСервер,
	               |	ИнформационныеБазы.Владелец.ПарольЦентральногоСервера КАК ПарольЦентральногоСервера,
	               |	ИнформационныеБазы.Владелец.АдресКластера КАК АдресКластера,
	               |	ИнформационныеБазы.Владелец.ПортКластера КАК ПортКластера,
	               |	ИнформационныеБазы.Владелец.ИмяАдминистратораКластера КАК ИмяАдминистратораКластера,
	               |	ИнформационныеБазы.Владелец.ПарольАдминистратораКластера КАК ПарольАдминистратораКластера,
	               |	ИнформационныеБазы.Владелец.РабочиеСерверыКластера.(
	               |		Имя КАК РабочиеСераерыИмя,
	               |		Порт КАК РабочиеСераерыПорт
	               |	) КАК РабочиеСераеры,
	               |	ИнформационныеБазы.ИмяИБ КАК ИмяИБ,
	               |	ИнформационныеБазы.СерверБД.ИмяСервера КАК СерверБД,
	               |	ИнформационныеБазы.СерверБД.ИмяАдминистратораСУБД КАК ИмяАдминистратораСУБД,
	               |	ИнформационныеБазы.СерверБД.ПарольАдминистратораСУБД КАК ПарольАдминистратораСУБД,
	               |	ИнформационныеБазы.БазаДанных КАК БазаДанных,
	               |	ИнформационныеБазы.ИмяПользователяИБ КАК ИмяПользователяИБ,
	               |	ИнформационныеБазы.ПарольПользователяИБ КАК ПарольПользователяИБ
	               |ИЗ
	               |	Справочник.ИнформационныеБазы КАК ИнформационныеБазы
	               |ГДЕ
	               |	ИнформационныеБазы.Ссылка = &ИнформационнаяБаза";
	
	Запрос.УстановитьПараметр("ИнформационнаяБаза", ИнформационнаяБаза);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураПараметров, Выборка); 
		Для Каждого Сервер Из Выборка.РабочиеСераеры Цикл

						
			
		КонецЦикла;
		
	КонецЕсли;   
	
	Возврат СтруктураПараметров;
	
КонецФункции // ПолучитьПараметрыИнформационнойБазы()

Функция ПолучитьСвойстваИнформационнойБазы(ИнформационнаяБаза, Отказ = Ложь) Экспорт
	
	ИдентификаторИнформационнойБазы = ИнформационнаяБаза.ИдентификаторБазы;
	МассивИнформационныхБаз = АдминистрированиеСерверов.ПолучитьБазыКластера(ИнформационнаяБаза.Владелец);
	Для Каждого АдминистрированиеИнформационнойБазы Из МассивИнформационныхБаз Цикл
		
		Если АдминистрированиеИнформационнойБазы.ИдентификаторИнформационнойБазы = ИдентификаторИнформационнойБазы Тогда
			Попытка
				АдминистрированиеИнформационнойБазы.ВыполнитьАутентификацию(ИнформационнаяБаза.ИмяПользователяИБ, ИнформационнаяБаза.ПарольПользователяИБ);
			Исключение
				Отказ = Истина;
			КонецПопытки;
			
			Возврат АдминистрированиеИнформационнойБазы;	
		КонецЕсли;
	КонецЦикла;  
	
	Возврат Неопределено;

КонецФункции // ПолучитьСвойстваИнформационнойБазы()
